 • Данные — это информация, которая хранится и обрабатывается в системе (например, имя, возраст, адрес).
 • База данных — это организованная коллекция данных, которую можно эффективно искать, изменять и удалять.
 • Реляционная база данных — база данных, в которой данные хранятся в виде таблиц, связанных между собой.
 • Таблица — структура в базе данных, состоящая из строк и столбцов, где хранятся данные.

 1. Хранение и управление данными.
 2. Защита и контроль доступа к данным.
 3. Поддержка транзакций и целостности данных.
 4. Восстановление данных после сбоев.
 5. Поддержка аналитических запросов и отчетности.


 1. Windows-аутентификация — используется учетная запись Windows.
 2. SQL Server-аутентификация — используется логин и пароль, заданные в SQL Server.


   
